chapter10/readme.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Chapter 10</title>
<meta name="author" content="(Bill Carlson)"/>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/reveal.js/3.0.0/css/reveal.css"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/reveal.js/3.0.0/css/theme/sky.css" id="theme"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/reveal.js/3.0.0/lib/css/zenburn.css"/>
<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">Chapter 10</h1><h2 class="author">Bill Carlson</h2><p class="date">Created: 2018-03-16 Fri 09:00</p>
</section>

<section>
<section id="slide-orga0ac28c">
<h2 id="orga0ac28c">Foldable</h2>
<div class="outline-text-2" id="text-orga0ac28c">
</div>
</section>
</section>
<section>
<section id="slide-orge178189">
<h3 id="orge178189">Understanding Folds</h3>
<div class="org-src-container">

<pre><code class="haskell" >foldr (*) 1 [1..5]
</code></pre>
</div>
<p>
will return the same as: 
</p>
<div class="org-src-container">

<pre class="fragment"><code class="haskell" >foldl (flip (*)) 1 [1..5]
</code></pre>
</div>
<div class="org-src-container">

<pre class="fragment"><code class="haskell" >foldl (*) 1 [1..5]
</code></pre>
</div>

</section>
<section >
<p>
Write out the evaluation steps of
</p>
<div class="org-src-container">

<pre><code class="haskell" >foldl (flip (*)) 1 [1..3]
</code></pre>
</div>
<div class="org-src-container">

<pre class="fragment"><code class="haskell" >foldl (flip (*)) (1 * 1) [2..3])
foldl (flip (*)) (1 * 1 * 2) [3])
foldl (flip (*)) (1 * 1 * 2 * 3) [])
(1 * 1 * 2 * 3)
6
</code></pre>
</div>

</section>
<section >
<p>
One difference between <code>foldr</code> and <code>foldl</code> is:
</p>
<ul class="fragment">
<li>(c) <code>foldr</code>, but not <code>foldl</code>, associates to the right</li>

</ul>

</section>
<section >
<p>
Folds are catamorphisms, which are generally used to:
</p>
<ul class="fragment">
<li>(a) reduce structure</li>

</ul>

</section>
<section >
<p>
The following are simple folds very similar to what you’ve already
seen, but each has at least one error.
</p>
<div class="org-src-container">

<pre><code class="haskell" >foldr (++) ["woot", "WOOT", "woot"]
</code></pre>
</div>
<div class="org-src-container">

<pre class="fragment"><code class="haskell" >foldr (++) [] ["woot", "WOOT", "woot"]
</code></pre>
</div>

<div class="org-src-container">

<pre><code class="haskell" >foldr max [] "fear is the little death"
</code></pre>
</div>
<div class="org-src-container">

<pre class="fragment"><code class="haskell" >import Data.Char
foldr max (chr 0) "fear is the little death"
</code></pre>
</div>

<div class="org-src-container">

<pre><code class="haskell" >foldr and True [False, True]
</code></pre>
</div>
<div class="org-src-container">

<pre class="fragment"><code class="haskell" >foldr (&&) True [False, True]
</code></pre>
</div>

</section>
<section >
<p>
This one is more subtle than the previous. Can it ever
return a different answer?
</p>

<div class="org-src-container">

<pre><code class="haskell" >foldr (||) True [False, True]
</code></pre>
</div>
<div class="org-src-container">

<pre class="fragment"><code class="haskell" >foldr (||) False (take 1 [False, True]) --  (?)
</code></pre>
</div>

<div class="org-src-container">

<pre><code class="haskell" >foldl ((++) . show) "" [1..5]
</code></pre>
</div>
<div class="org-src-container">

<pre class="fragment"><code class="haskell" >foldl (flip ((++) . show)) "" [1..5]
</code></pre>
</div>

<div class="org-src-container">

<pre><code class="haskell" >foldr const 'a' [1..5]
</code></pre>
</div>
<div class="org-src-container">

<pre class="fragment"><code class="haskell" >foldr const (ord 'a') [1..5]
</code></pre>
</div>
</section>
<section >
<div class="org-src-container">

<pre><code class="haskell" >foldr const 0 "tacos"
</code></pre>
</div>
<div class="org-src-container">

<pre class="fragment"><code class="haskell" >foldr const (chr 0) "tacos"
</code></pre>
</div>

<div class="org-src-container">

<pre><code class="haskell" >foldl (flip const) 0 "burritos"
</code></pre>
</div>
<div class="org-src-container">

<pre class="fragment"><code class="haskell" >foldl (flip const) (chr 0) "burritos"
</code></pre>
</div>

<div class="org-src-container">

<pre><code class="haskell" >foldl (flip const) 'z' [1..5]
</code></pre>
</div>
<div class="org-src-container">

<pre class="fragment"><code class="haskell" >foldl (flip const) (ord 'z') [1..5]
</code></pre>
</div>

</section>
</section>
<section>
<section id="slide-org7a8c23b">
<h3 id="org7a8c23b">Database Processing</h3>
<div class="org-src-container">

<pre><code class="haskell" >data DatabaseItem = DbString String
                  | DbNumber Integer
                  | DbDate UTCTime
  deriving (Eq, Ord, Show)

theDatabase :: [DatabaseItem]
theDatabase =
  [ DbDate (UTCTime
           (fromGregorian 1911 5 1)
           (secondsToDiffTime 34123))
  , DbNumber 9001
  , DbString "Hello, world!"
  , DbDate (UTCTime
           (fromGregorian 1921 5 1)
           (secondsToDiffTime 34123))
  ]
</code></pre>
</div>

</section>
<section >
<div class="org-src-container">

<pre><code class="haskell" >filterDbDate :: [DatabaseItem] -> [UTCTime]
</code></pre>
</div>
<div class="org-src-container">

<pre class="fragment"><code class="haskell" >filterDbDate = foldr filterDate []
  where filterDate (DbDate time) xs = time : xs
        filterDate _ xs = xs 
</code></pre>
</div>

</section>
<section >
<div class="org-src-container">

<pre><code class="haskell" >filterDbNumber :: [DatabaseItem] -> [Integer]
</code></pre>
</div>
<div class="org-src-container">

<pre class="fragment"><code class="haskell" >filterDbNumber = foldr filterNum []
  where filterNum (DbNumber num) xs = num : xs
        filterNum _ xs = xs 
</code></pre>
</div>

</section>
<section >
<div class="org-src-container">

<pre><code class="haskell" >mostRecent :: [DatabaseItem] -> UTCTime
</code></pre>
</div>
<div class="org-src-container">

<pre class="fragment"><code class="haskell" >mostRecent = last . sort . filterDbDate
</code></pre>
</div>

</section>
<section >
<div class="org-src-container">

<pre><code class="haskell" >sumDb :: [DatabaseItem] -> Integer
</code></pre>
</div>
<div class="org-src-container">

<pre class="fragment"><code class="haskell" >sumDb = foldr (+) 0 . filterDbNumber
</code></pre>
</div>

</section>
<section >
<div class="org-src-container">

<pre><code class="haskell" >avgDb :: [DatabaseItem] -> Double
</code></pre>
</div>
<div class="org-src-container">

<pre class="fragment"><code class="haskell" >avgDb db = let
  filtered = filterDbNumber db
  l = length filtered
  s = foldr (+) 0 filtered
  in (fromIntegral s) / (fromIntegral l)
</code></pre>
</div>

</section>
</section>
<section>
<section id="slide-org889ed81">
<h3 id="org889ed81">Scans</h3>
</section>
<section >
<p>
`1`. Modify your fibs function to only return the first 20 Fibonacci
numbers.
</p>
<div class="org-src-container">

<pre class="fragment"><code class="haskell" >fibs = take 20 $ 1 : scanl (+) 1 fibs
</code></pre>
</div>

</section>
<section >
<p>
`2`. Modify fibs to return the Fibonacci numbers that are less than
</p>
<ol>
<li></li>

</ol>
<div class="org-src-container">

<pre class="fragment"><code class="haskell" >fibs = takeWhile (<100) $ 1 : scanl (+) 1 fibs
</code></pre>
</div>

</section>
<section >
<p>
`3`. Try to write the factorial function from Recursion as a scan.
You’ll want scanl again, and your start value will be 1.
</p>
<div class="org-src-container">

<pre class="fragment"><code class="haskell" >
</code></pre>
</div>

</section>
</section>
<section>
<section id="slide-org4e0c481">
<h2 id="org4e0c481">Chapter Exercises</h2>
<div class="outline-text-2" id="text-org4e0c481">
</div>
</section>
</section>
<section>
<section id="slide-org394524a">
<h3 id="org394524a">Warm-up</h3>
<div class="org-src-container">

<pre class="fragment"><code class="haskell" >tuples :: [(Char, Char, Char)]
tuples = [(x, y, z) | x <- stops, y <- vowels, z <- stops]

tuples' :: [(Char, Char, Char)]
tuples' = [('p', y, z) | y <- vowels, z <- stops]

wordTuples :: [(String, String, String)]
wordTuples = [(x, y, z) | x <- nouns, y <- verbs, z <- nouns]

tupled :: [a] -> [b] -> [(a, b, a)]
tupled a b = [(x, y, z) | x <- a, y <- b, z <- a]
</code></pre>
</div>

</section>
<section >
<div class="org-src-container">

<pre><code class="haskell" >seekritFunc x =
 div (sum (map length (words x)))
     (length (words x))
</code></pre>
</div>
<ul class="fragment">
<li>Takes a sentence</li>
<li>divides the sum of the lengths of the words by the number of words</li>
<li>Or&#x2026; returns the average length of the words in the sentence</li>

</ul>
<div class="org-src-container">

<pre class="fragment"><code class="haskell" >seekritFuncF x =
 (/) (fromIntegral (sum (map length (words x))))
     (fromIntegral (length (words x)))
</code></pre>
</div>

</section>
<section id="slide-org8d874ad">
<h4 id="org8d874ad">Rewrite functions</h4>
<ul>
<li><code>or</code></li>

</ul>
<div class="org-src-container">

<pre class="fragment"><code class="haskell" >myOr = foldr (||) False
</code></pre>
</div>
<ul>
<li><code>any</code></li>

</ul>
<div class="org-src-container">

<pre class="fragment"><code class="haskell" >myAny f = (foldr (||) False) . (map f)
</code></pre>
</div>
<ul>
<li><code>elem</code></li>

</ul>
<div class="org-src-container">

<pre class="fragment"><code class="haskell" >myElem x = foldr ((||) . (==x)) False
myElem' x = myAny (==x)
</code></pre>
</div>
</section>
<section >
<ul>
<li><code>reverse</code></li>

</ul>
<div class="org-src-container">

<pre class="fragment"><code class="haskell" >foldl' (flip (:)) [] [1,2,3,4]
</code></pre>
</div>
<ul>
<li><code>filter</code></li>

</ul>
<div class="org-src-container">

<pre class="fragment"><code class="haskell" >myReverse = foldl (flip (:)) [] [1..24]
</code></pre>
</div>
<ul>
<li><code>map</code></li>

</ul>
<div class="org-src-container">

<pre class="fragment"><code class="haskell" >myMap f xs = foldr (\a e -> f a : e) [] xs
</code></pre>
</div>

<ul>
<li><code>squish</code></li>

</ul>
<div class="org-src-container">

<pre class="fragment"><code class="haskell" >mySquish :: [[a]] -> [a]
mySquish = foldr (++) []
</code></pre>
</div>
</section>
<section >
<ul>
<li><code>squishMap</code></li>

</ul>
<div class="org-src-container">

<pre class="fragment"><code class="haskell" >squishMap :: [a] -> (a -> [b]) -> [b]
squishMap as f = foldr (\a e -> (f a) ++ e) [] as
</code></pre>
</div>
<ul>
<li><code>squishAgain</code></li>

</ul>
<div class="org-src-container">

<pre class="fragment"><code class="haskell" >
</code></pre>
</div>
<ul>
<li><code>maximumBy</code></li>

</ul>
<div class="org-src-container">

<pre class="fragment"><code class="haskell" >
</code></pre>
</div>
</section>
</section>
</div>
</div>
<script src="https://cdn.jsdelivr.net/reveal.js/3.0.0/lib/js/head.min.js"></script>
<script src="https://cdn.jsdelivr.net/reveal.js/3.0.0/js/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: false,
center: true,
slideNumber: 'c',
rollingLinks: false,
keyboard: true,
overview: true,

theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
transition: Reveal.getQueryHash().transition || 'slide', // default/cube/page/concave/zoom/linear/fade/none
transitionSpeed: 'default',
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: 'https://cdn.jsdelivr.net/reveal.js/3.0.0/plugin/highlight/highlight.js', async: true, callback: function() { hljs.initHighlightingOnLoad(); } },
 { src: 'https://cdn.jsdelivr.net/reveal.js/3.0.0/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }]
});
</script>
</body>
</html>
